Update docs & add data model
